; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	image2 - mode
	infrared1 - mode
	Star6 - direction
	GroundStation4 - direction
	Star2 - direction
	Star1 - direction
	GroundStation7 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation3 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
	(supports instrument3 image2)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image0)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument5 image2)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 image2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation7)
	(supports instrument7 image2)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Star8 infrared1)
	(have_image Planet9 image0)
	(have_image Planet10 image0)
	(have_image Star11 image2)
	(have_image Planet12 infrared1)
	(have_image Star13 infrared1)
	(have_image Phenomenon14 image2)
	(have_image Star15 image0)
))

)

; plan
1. (turn_to satellite2 star0 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star0)
   goals met: 0 of 9
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite2 planet12 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet12)
   goals met: 0 of 9
5. (take_image satellite2 planet12 instrument3 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 1 of 9
6. (turn_to satellite2 planet10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet10)
   goals met: 1 of 9
7. (take_image satellite2 planet10 instrument3 image0)
   added: (have_image planet10 image0)
   goals met: 2 of 9
8. (turn_to satellite2 phenomenon14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 9
9. (turn_to satellite0 groundstation4 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon14 instrument3 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 9
11. (turn_to satellite2 planet9 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet9)
   goals met: 4 of 9
12. (take_image satellite2 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 5 of 9
13. (turn_to satellite2 star11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star11)
   goals met: 5 of 9
14. (take_image satellite2 star11 instrument3 image2)
   added: (have_image star11 image2)
   goals met: 6 of 9
15. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 6 of 9
16. (take_image satellite2 star13 instrument3 infrared1)
   added: (have_image star13 infrared1)
   goals met: 7 of 9
17. (turn_to satellite2 star15 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star15)
   goals met: 7 of 9
18. (take_image satellite2 star15 instrument3 image0)
   added: (have_image star15 image0)
   goals met: 8 of 9
19. (turn_to satellite2 star8 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star8)
   goals met: 8 of 9
20. (take_image satellite2 star8 instrument3 infrared1)
   added: (have_image star8 infrared1)
   goals met: 9 of 9
